{"meta":{"title":"Away & Away","subtitle":null,"description":null,"author":"S.C. Barrus","url":"http://awayandaway.com"},"pages":[],"posts":[{"title":"And We're Back Online","slug":"hello-world","date":"2016-08-05T21:04:41.000Z","updated":"2016-08-19T14:29:34.000Z","comments":true,"path":"2016/08/05/hello-world/","link":"","permalink":"http://awayandaway.com/2016/08/05/hello-world/","excerpt":"","text":"img sourceWow. It’s been a while. Well, the hiatus is over and I’m here to stay. If you’re wondering what I’m talking about, let me introduce myself. Hi, I’m Cody. I’m sort of a writer, coder and pop culture geek. I wrote a novel called Discovering Aberration among other things, and for a long while I maintained this site. Then, for reasons, I pulled the plug on it and slunk into a cave for a year. Well guess what bitches, I’m back! This is my pheonix like revival. From the ashes of the old Away &amp; Away will rise a greater, more terrible force. Ch-ch-ch-changesFirst watch this sweet David Bowie video, and then we’ll talk about what’s different about the old and new sites. A quick story: For years I was pretty much a starving artist. It sucked. After years of it, I decided to really try to make a living with fiction. I kind of had a break down. Then I quit everything artistic. Time passed, now I’m not a starving artist. I learned to code, and now I’m a professional web developer who also writes. The difference is, these days I’m not plagued by the constant stress of how well my books are selling. So I can take time to write, focus on the art, and if nobody buys it, that’s fine. That was a long way of saying: The old site was a marketing machine This new site is my place to share what I love, fuck marketing This will be a place for you to discover hidden gems. That’s what I like to do, find things no one else has found and share them everywhere. So that means lots of posts on: Movies - Indie, martial arts, and obscure films that I have a passion for will be shared here. Music - Mostly I listen to hardcore, punk, alt rock, and some folky-ish stuff. I’ll focus on sharing things that have less than 100,000 monthly listeners on Spotify. Hopefully that will guaruntee you’re discovering new stuff. Books - Of course. I’m a writer, which means I’m also a reader. When it comes to books, I’ll just share the books I’ve enjoyed after finishing them. Not reviews, recommendations. Anime - Because I’m an anime nerd and there’s so much out there, I’ll be sharing a lot of my favorite anime too. Things like Berzerk, Gurren Laggan, Full Metal Alchemist, Psycho Pass, Attack on Titan. If you’re already an anime nerd, you probably know all those names, but if you’re not, let me guide you past the shitty shows and on to the good stuff. Code - I’ll keep code posts to a minimum, but this site is a side project with one of the goals being to over engineer the hell out of it. It’s built with Hexo, a static site generator, and I’ll be adding cool features like service workers, and other cool shit. If you don’t know what that means, that’s fine, it’ll just be a way for me to cement what I’m learning through teaching. If we want to keep with the edgy vibe, we can call it hacker-ville or something… That pretty much sums it up. Hey look, I have a site up!","categories":[],"tags":[],"keywords":[]}]}